source: learned_device_inventory_info
description: Auto-learned patterns for Device Inventory Info (verified field mappings)
version: 1
auto_generated: true
verified: true
patterns:
- name: learned_5001_0822
  match:
    log_format:
    - json
    json_has:
    - agent_load_flags
    - agent_local_time
    - agent_version
    - bios_manufacturer
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
  field_map:
    connection_ip: src_endpoint.ip
    group_hash: file.hashes.value
    hostname: device.hostname
    serial_number: device.uid
    status: status
- name: learned_5001_6150
  match:
    log_format:
    - json
    json_has:
    - actor.callerType
    - actor.email
    - actor.profileId
    - events.name
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
  field_map:
    actor.email: actor.user.name
    actor.profileId: actor.user.uid
    events.name: activity_name
    ipAddress: src_endpoint.ip
- name: learned_5001_6067
  match:
    log_format:
    - json
    json_has:
    - architecture
    - authMethod
    - browserName
    - browserUpdateStatus
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
  field_map:
    email: user
    externalIpAddress: src_endpoint.ip
    status: status
- name: learned_5001_0550
  match:
    log_format:
    - json
    json_has:
    - ClientNetworkLocation
    - ComputerId
    - FullVersion
    - HostName
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
  field_map:
    ClientNetworkLocation: src_endpoint.ip
    HostName: device.hostname
    ServerNetworkLocation: dst_endpoint.ip
    Status: status
- name: learned_5001_0357
  match:
    log_format:
    - json
    json_has:
    - '@timestamp'
    - event
    - log.file.device_id
    - log.file.inode
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
  field_map:
    network.transport: connection_info.protocol_name
    source.ip: src_endpoint.ip
    source.port: src_endpoint.port
