source: sudo
description: sudo command execution and authorization logs
version: 1
patterns:
  - name: sudo_command_executed
    match:
      log_format: [syslog_bsd, syslog_rfc5424, syslog_rfc3164]
      regex: '(?P<user>\S+)\s*:\s*TTY=(?P<tty>\S+)\s*;\s*PWD=(?P<pwd>\S+)\s*;\s*USER=(?P<target_user>\S+)\s*;\s*COMMAND=(?P<command>.+)$'
    ocsf_class_uid: 1007
    ocsf_class_name: Process Activity
    static:
      activity_id: 1
      activity_name: "Launch"
      severity_id: 2
      status_id: 1
      status: "Success"
      category_uid: 1
      category_name: "System Activity"
      type_uid: 100701
    field_map:
      user: actor.user.name
      target_user: actor.user.credential_uid
      command: process.cmd_line
      pwd: process.file.parent_folder
      tty: actor.session.uid

  - name: sudo_auth_failure
    match:
      log_format: [syslog_bsd, syslog_rfc5424, syslog_rfc3164]
      regex: 'pam_unix\(sudo:auth\):\s+authentication\s+failure;\s+logname=(?P<logname>\S*)\s+uid=(?P<uid>\d+)\s+.*ruser=(?P<ruser>\S*)\s+.*user=(?P<user>\S+)'
    ocsf_class_uid: 3002
    ocsf_class_name: Authentication
    static:
      activity_id: 1
      activity_name: "Logon"
      severity_id: 4
      status_id: 2
      status: "Failure"
      category_uid: 3
      category_name: "Identity & Access Management"
      auth_protocol: "pam"
      type_uid: 300201
    field_map:
      user: actor.user.name
      uid: actor.user.uid
      ruser: actor.user.credential_uid

  - name: sudo_not_allowed
    match:
      log_format: [syslog_bsd, syslog_rfc5424, syslog_rfc3164]
      regex: '(?P<user>\S+)\s*:\s*user\s+NOT\s+in\s+sudoers\s*;\s*TTY=(?P<tty>\S+)\s*;\s*PWD=(?P<pwd>\S+)\s*;\s*USER=(?P<target_user>\S+)\s*;\s*COMMAND=(?P<command>.+)$'
    ocsf_class_uid: 3002
    ocsf_class_name: Authentication
    static:
      activity_id: 1
      activity_name: "Logon"
      severity_id: 4
      status_id: 2
      status: "Failure"
      category_uid: 3
      category_name: "Identity & Access Management"
      type_uid: 300201
    field_map:
      user: actor.user.name
      target_user: actor.user.credential_uid
      command: process.cmd_line
      pwd: process.file.parent_folder

  - name: sudo_ansible_become
    match:
      log_format: [syslog_bsd, syslog_rfc5424, syslog_rfc3164]
      regex: 'sudo\[(?P<pid>\d+)\]:\s+(?P<user>\S+)\s*:\s*PWD=(?P<pwd>\S+)\s*;\s*USER=(?P<target_user>\S+)\s*;\s*COMMAND=(?P<command>.+)$'
      contains: "sudo"
    ocsf_class_uid: 3005
    ocsf_class_name: User Access Management
    static:
      activity_id: 1
      severity_id: 1
      category_uid: 3
      category_name: "Identity & Access Management"
    field_map:
      user: user
      target_user: privileges
      command: message
      pwd: process.file.path
