source: mined_detection_finding
description: Auto-mined patterns for Detection Finding from ground truth
version: 1
auto_generated: true
patterns:
- name: json_fp_2004_9491
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Attributes
    - AttributesComputedBitMap
    - EventGuid
    - GenerateIncident
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_3381
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Tenant
    - _TimeReceivedBySvc
    - category
    - operationName
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
    operationName: api.operation
- name: json_fp_2004_2782
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - event
    - metadata
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_3096
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Attributes
    - AttributesComputedBitMap
    - Category
    - CategoryComputedMap
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_5870
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - accountId
    - activityType
    - agentId
    - agentUpdatedVersion
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_1307
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Tenant
    - category
    - operationName
    - properties
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
    operationName: api.operation
    time: time
- name: json_fp_2004_1559
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - category
    - operationName
    - properties
    - tenantId
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
    operationName: api.operation
    time: time
- name: json_fp_2004_9552
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - alertId
    - alertInfo
    - alertName
    - alertType
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_0660
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - actor
    - change_type
    - created_time
    - enterprise_guid
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_3894
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - accountId
    - arn
    - createdAt
    - description
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_1080
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - customer_id
    - datastream
    - dhost
    - duid
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_9105
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - category
    - content
    - creationDate
    - id
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
- name: json_fp_2004_5434
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - customer_id
    - datastream
    - dhost
    - end
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_9401
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - commentCount
    - creationTime
    - device
    - log_type
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_2159
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - event
    - host
    - source
    - sourcetype
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    host: device.hostname
    time: time
- name: json_fp_2004_2703
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - action_country
    - action_external_hostname
    - action_file_macro_sha256
    - action_file_md5
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_6572
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AdditionalData
    - Attributes
    - AttributesComputedBitMap
    - EventGuid
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_3318
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - action
    - category
    - channel
    - data
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
    category: finding_info.types
- name: json_fp_2004_1459
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - domaintools
    - event
    - threat
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
- name: json_fp_2004_8038
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - created
    - description
    - id
    - labels
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_5603
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@event_create_date'
    - '@timestamp'
    - '@version'
    - agent
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
- name: json_fp_2004_7042
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - action
    - action_pretty
    - agent_data_collection_status
    - agent_device_domain
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
- name: json_fp_2004_0253
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - account
    - action
    - details
    - device
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
- name: json_fp_2004_1244
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - alertProvider
    - createdDateTime
    - description
    - id
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_1962
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - account_id
    - action
    - custom_group_folder_id
    - custom_group_folder_info
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
- name: json_fp_2004_3571
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - acknowledged
    - activityId
    - aiaScore
    - attackPhases
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
- name: json_fp_2004_9548
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@event_create_date'
    - '@timestamp'
    - agent
    - conn_type
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
- name: json_fp_2004_2397
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - additional_data
    - additional_properties
    - classification
    - classification_comment
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_0466
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - '@version'
    - destination
    - device
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
- name: json_fp_2004_8369
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Action
    - Category
    - Client
    - Description
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_2372
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - active_detection_types
    - attack_rating
    - breadth_contrib
    - category
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
- name: json_fp_2004_8268
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@class'
    - activeProcessesCount
    - closed
    - closerName
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_2288
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - action
    - cause
    - domain
    - event_type
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
    hostname: device.hostname
- name: json_fp_2004_0711
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - appliance_id
    - assignee
    - categories
    - description
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_7243
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@event_create_date'
    - '@timestamp'
    - agent
    - computer_name
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
- name: json_fp_2004_9329
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - category
    - company
    - content
    - creationDate
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    category: finding_info.types
- name: json_fp_2004_8698
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - action
    - agent
    - event
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
    action: activity_name
    host: device.hostname
- name: json_fp_2004_6879
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - action
    - agent
    - event
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    '@timestamp': time
    action: activity_name
    host: device.hostname
- name: json_fp_2004_2517
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - agentDetectionInfo
    - agentRealtimeInfo
    - containerInfo
    - ecsInfo
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_8069
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - dest_ip
    - dest_port
    - dns
    - event_type
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    dest_ip: dst_endpoint.ip
    dest_port: dst_endpoint.port
- name: json_fp_2004_5250
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - detail
    - detectedDateTime
    - endpoint
    - entityName
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map: {}
- name: json_fp_2004_8593
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - accessed_data
    - action
    - custom_date_range
    - date
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
- name: json_fp_2004_3015
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - account_id
    - action
    - custom_group_folder_id
    - custom_group_folder_info
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
- name: json_fp_2004_5817
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - action
    - clientTimestamp
    - details
    - device
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    action: activity_name
