source: mined_dns_activity
description: Auto-mined patterns for DNS Activity from ground truth
version: 1
auto_generated: true
patterns:
- name: json_fp_4003_2649
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - QueryName
    - QueryType
    - ResponseCode
    - Timestamp
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map: {}
