source: mined_process_activity
description: Auto-mined patterns for Process Activity from ground truth
version: 1
auto_generated: true
patterns:
- name: json_fp_1007_2957
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - DomainName
    - EventID
    - LogHost
    - LogonID
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    DomainName: user.domain
    EventID: metadata.event_code
    LogHost: device.hostname
    LogonID: session.uid
    ParentProcessID: process.parent_process.pid
- name: json_fp_1007_1612
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - DomainName
    - EventID
    - LogHost
    - LogonID
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    DomainName: user.domain
    EventID: metadata.event_code
    LogHost: device.hostname
    LogonID: session.uid
    ProcessID: process.pid
    ProcessName: process.name
- name: json_fp_1007_2259
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - category
    - level
    - properties
    - time
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    category: finding_info.types
    level: severity
    time: time
- name: json_fp_1007_6489
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - account.id
    - agent.uuid
    - agent.version
    - dataSource.category
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_8621
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - '@version'
    - agent
    - ecs
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
- name: json_fp_1007_1404
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@metadata'
    - '@timestamp'
    - agent
    - ecs
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
- name: json_fp_1007_7976
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - '@version'
    - agent
    - ecs
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
- name: json_fp_1007_2010
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - '@version'
    - agent
    - data_stream
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
- name: json_fp_1007_2189
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - Channel
    - Domain
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    EventID: metadata.event_code
- name: json_fp_1007_7818
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - ecs
    - event
    - host
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
    message: message
- name: json_fp_1007_3621
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountSessionIdentifier
    - ActivityID
    - AuthenticationProvider
    - AuthenticationServer
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_2405
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - Category
    - Channel
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    CommandLine: process.cmd_line
- name: json_fp_1007_7118
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - ActivityID
    - Category
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_9188
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@metadata'
    - '@timestamp'
    - agent
    - ecs
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
- name: json_fp_1007_6506
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@metadata'
    - '@timestamp'
    - agent
    - auditd
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
- name: json_fp_1007_5338
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - '@version'
    - agent
    - ecs
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
- name: json_fp_1007_7492
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - '@timestamp'
    - ecs
    - event
    - host
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    '@timestamp': time
    host: device.hostname
    message: message
- name: json_fp_1007_0566
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AuthenticationId
    - AuthenticodeHashData
    - CommandLine
    - ConfigBuild
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    CommandLine: process.cmd_line
- name: json_fp_1007_1951
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - GatewayIP
    - GatewayMAC
    - InterfaceAlias
    - InterfaceDescription
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_4409
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - account.id
    - agent.uuid
    - agent.version
    - dataSource.category
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_1633
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - event
    - fields
    - host
    - hostname
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    host: device.hostname
    hostname: device.hostname
- name: json_fp_1007_4609
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - Category
    - Channel
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    EventID: metadata.event_code
- name: json_fp_1007_0133
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AppCorrelationID
    - AttributeLDAPDisplayName
    - AttributeSyntaxOID
    - AttributeValue
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_6706
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - Channel
    - CommandLine
    - EventID
    - EventReceivedTime
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    CommandLine: process.cmd_line
    EventID: metadata.event_code
- name: json_fp_1007_4368
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - Category
    - Channel
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map: {}
- name: json_fp_1007_6257
  match:
    log_format:
    - json
    - evtx_json
    json_has:
    - AccountName
    - AccountType
    - Category
    - Channel
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    EventID: metadata.event_code
