source: universal_kv
description: Universal catch-all patterns for kv format
version: 1
auto_generated: true
patterns:
- name: catchall_kv_6003
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6003
  ocsf_class_name: API Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_kv_3002
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3002
  ocsf_class_name: Authentication
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_kv_4013
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4013
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_1004
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1004
  ocsf_class_name: Memory Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_kv_1005
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1005
  ocsf_class_name: Module Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_kv_4014
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4014
  ocsf_class_name: Email URL Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4001
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4003
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4002
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4002
  ocsf_class_name: HTTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4009
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4009
  ocsf_class_name: Email Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4007
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4007
  ocsf_class_name: SSH Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_4011
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4011
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_kv_3003
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3003
  ocsf_class_name: Authorize Session
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_kv_1001
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1001
  ocsf_class_name: File System Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_kv_3004
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_kv_3006
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3006
  ocsf_class_name: Group Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_kv_5003
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_kv_1008
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_kv_6006
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_kv_2003
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_kv_4005
  match:
    log_format:
    - kv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
