source: universal_syslog_bsd
description: Universal catch-all patterns for syslog_bsd format
version: 1
auto_generated: true
patterns:
- name: catchall_syslog_bsd_4001
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_3002
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3002
  ocsf_class_name: Authentication
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_1006
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1006
  ocsf_class_name: Scheduled Job Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_3001
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3001
  ocsf_class_name: Account Change
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_3003
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3003
  ocsf_class_name: Authorize Session
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_3005
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3005
  ocsf_class_name: User Access Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_3006
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3006
  ocsf_class_name: Group Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_4004
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4004
  ocsf_class_name: DHCP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_4006
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4006
  ocsf_class_name: SMB Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_4008
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4008
  ocsf_class_name: FTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_4012
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4012
  ocsf_class_name: NTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_1004
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1004
  ocsf_class_name: Memory Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_1005
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1005
  ocsf_class_name: Module Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_2006
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2006
  ocsf_class_name: Data Security Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_syslog_bsd_4014
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4014
  ocsf_class_name: Email URL Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_3004
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_syslog_bsd_4005
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_4010
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4010
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_1008
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_6006
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_syslog_bsd_2003
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_syslog_bsd_5003
  match:
    log_format:
    - syslog_bsd
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
