source: universal_xml
description: Universal catch-all patterns for xml format
version: 1
auto_generated: true
patterns:
- name: catchall_xml_2004
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_xml_1007
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_xml_4001
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_xml_1008
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_xml_2003
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_xml_3004
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_xml_4004
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4004
  ocsf_class_name: DHCP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_xml_4005
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_xml_4010
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4010
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_xml_5003
  match:
    log_format:
    - xml
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
