source: universal_csv
description: Universal catch-all patterns for csv format
version: 1
auto_generated: true
patterns:
- name: catchall_csv_4001
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_4003
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_4002
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4002
  ocsf_class_name: HTTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_4004
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4004
  ocsf_class_name: DHCP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_6003
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6003
  ocsf_class_name: API Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_csv_1007
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_csv_2005
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2005
  ocsf_class_name: Incident Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_csv_4013
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4013
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_5004
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5004
  ocsf_class_name: OS Patch State
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_csv_6005
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6005
  ocsf_class_name: Datastore Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_csv_6007
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6007
  ocsf_class_name: Scan Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_csv_4011
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4011
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_3003
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3003
  ocsf_class_name: Authorize Session
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_csv_3004
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_csv_3006
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3006
  ocsf_class_name: Group Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_csv_4005
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_4010
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4010
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_csv_1008
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_csv_6006
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_csv_2003
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_csv_5003
  match:
    log_format:
    - csv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
