source: universal_json
description: Universal catch-all patterns for json format
version: 1
auto_generated: true
patterns:
- name: catchall_json_6003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6003
  ocsf_class_name: API Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_json_4009
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4009
  ocsf_class_name: Email Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_2004
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_json_6002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6002
  ocsf_class_name: Application Lifecycle
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_json_4002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4002
  ocsf_class_name: HTTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_5001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_json_2002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2002
  ocsf_class_name: Vulnerability Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_json_3002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3002
  ocsf_class_name: Authentication
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_json_5002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5002
  ocsf_class_name: Device Config State
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_json_2001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2001
  ocsf_class_name: Security Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_json_4001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_3004
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_json_3001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3001
  ocsf_class_name: Account Change
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_json_4003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_5003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_json_1001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1001
  ocsf_class_name: File System Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_3006
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3006
  ocsf_class_name: Group Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_json_4004
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4004
  ocsf_class_name: DHCP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_1007
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_4010
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4010
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_4011
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4011
  ocsf_class_name: TLS/SSL Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_4005
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_4006
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4006
  ocsf_class_name: SMB Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_6001
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6001
  ocsf_class_name: Web Resources Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_json_1004
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1004
  ocsf_class_name: Memory Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_1005
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1005
  ocsf_class_name: Module Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_2006
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2006
  ocsf_class_name: Data Security Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_json_4014
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4014
  ocsf_class_name: Email URL Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_json_6005
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6005
  ocsf_class_name: Datastore Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_json_3003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3003
  ocsf_class_name: Authorize Session
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_json_7002
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 7002
  ocsf_class_name: Lateral Movement
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 7
    category_name: Remediation Activity
  field_map:
    msg: message
- name: catchall_json_7004
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 7004
  ocsf_class_name: Network Remediation Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 7
    category_name: Remediation Activity
  field_map:
    msg: message
- name: catchall_json_7003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 7003
  ocsf_class_name: Virtual Machine Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 7
    category_name: Remediation Activity
  field_map:
    msg: message
- name: catchall_json_2003
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_json_1010
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1010
  ocsf_class_name: Scheduled Job Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_1008
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_json_6006
  match:
    log_format:
    - json
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
