source: universal_tsv
description: Universal catch-all patterns for tsv format
version: 1
auto_generated: true
patterns:
- name: catchall_tsv_1008
  match:
    log_format:
    - tsv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_tsv_2003
  match:
    log_format:
    - tsv
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
