source: universal_cef
description: Universal catch-all patterns for cef format
version: 1
auto_generated: true
patterns:
- name: catchall_cef_2004
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_cef_1004
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1004
  ocsf_class_name: Memory Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_cef_4014
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4014
  ocsf_class_name: Email URL Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_cef_1007
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_cef_4003
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_cef_6003
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6003
  ocsf_class_name: API Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_cef_1001
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1001
  ocsf_class_name: File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_cef_1008
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_cef_6006
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_cef_2003
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_cef_3004
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_cef_4005
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_cef_5003
  match:
    log_format:
    - cef
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
