source: universal_custom
description: Universal catch-all patterns for custom format
version: 1
auto_generated: true
patterns:
- name: catchall_custom_6003
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6003
  ocsf_class_name: API Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_custom_6002
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6002
  ocsf_class_name: Application Lifecycle
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_custom_4002
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4002
  ocsf_class_name: HTTP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4001
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4001
  ocsf_class_name: Network Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_2004
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2004
  ocsf_class_name: Detection Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_custom_3002
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3002
  ocsf_class_name: Authentication
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_custom_1007
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1007
  ocsf_class_name: Process Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_1002
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1002
  ocsf_class_name: Kernel Extension Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_1006
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1006
  ocsf_class_name: Scheduled Job Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_2005
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2005
  ocsf_class_name: Incident Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_custom_4013
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4013
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_5001
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5001
  ocsf_class_name: Device Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_custom_5004
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5004
  ocsf_class_name: OS Patch State
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_custom_5019
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5019
  ocsf_class_name: Device Config State Change
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
- name: catchall_custom_6005
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6005
  ocsf_class_name: Datastore Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_custom_6007
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6007
  ocsf_class_name: Scan Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_custom_1004
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1004
  ocsf_class_name: Memory Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_4003
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4003
  ocsf_class_name: DNS Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4004
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4004
  ocsf_class_name: DHCP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4007
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4007
  ocsf_class_name: SSH Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4011
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4011
  ocsf_class_name: Tunnel Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4009
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4009
  ocsf_class_name: Email Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_3003
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3003
  ocsf_class_name: Authorize Session
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_custom_1001
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1001
  ocsf_class_name: File System Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_2003
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 2003
  ocsf_class_name: Compliance Finding
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 2
    category_name: Findings
  field_map:
    msg: message
- name: catchall_custom_3004
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3004
  ocsf_class_name: Entity Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_custom_3006
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 3006
  ocsf_class_name: Group Management
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 3
    category_name: Identity & Access Management
  field_map:
    msg: message
- name: catchall_custom_4005
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4005
  ocsf_class_name: RDP Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_4010
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 4010
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 4
    category_name: Network Activity
  field_map:
    msg: message
- name: catchall_custom_1008
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 1008
  ocsf_class_name: Event Log Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 1
    category_name: System Activity
  field_map:
    msg: message
- name: catchall_custom_6006
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 6006
  ocsf_class_name: Network File Activity
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 6
    category_name: Application Activity
  field_map:
    msg: message
- name: catchall_custom_5003
  match:
    log_format:
    - custom
    regex: (?P<msg>.{10,})
  ocsf_class_uid: 5003
  ocsf_class_name: User Inventory Info
  static:
    activity_id: 0
    severity_id: 1
    category_uid: 5
    category_name: Discovery
  field_map:
    msg: message
